jQuery(function ($) {

    let $dataNMessage = $("[data-n-message]");
    let $widgetPreview = $(".desktop-visible .widget_notice, .mobile-visible .widget_notice");
    

    

    setTimeout(function () {
        generateNotice();
    }, 2450); 


    
    //  Generates random credit notice.
     
    function generateNotice() {

        let users = [
            ["Анастасія", "Марія", "Софія", "Вероніка", "Вікторія", "Соломія", "Ангеліна", "Злата", "Аня", "Ева", "Поліна", "Аліса", "Олександра", "Мілана", "Дарья", "Аріна", "Дарина", "Кіра", "Катерина"],
            ["Артем", "Олександр", "Максим", "Дмитро", "Матвій", "Назар", "Богдан", "Марк", "Владислав", "Михайло", "Володимир", "Іван", "Давид", "Андрій"]
        ];

        let actions = [
            ["отримала кредит", "подалa заявку", "виплатилa кредит"],
            ["отримав кредит", "подав заявку", "виплатив кредит"],
        ];

        let cities = 
            {
                "id": "5", "parent_id": null, "name": "Україна", "areas": [{
                    "id": "2121",
                    "parent_id": "5",
                    "name": " Вінницька область ",
                    "areas": [{"id": " 3331 ", "parent_id": " 2121 ", "name": " Бар ", "areas": []}, {
                        "id": " 3332 ",
                        "parent_id": "2121",
                        "name": "Бершадь",
                        "areas": []
                    }, {"id": "116", "parent_id": "2121", "name": "Вінниця", "areas": []}, {
                        "id": "3333",
                        "parent_id": "2121",
                        "name": "Гайсин",
                        "areas": []
                    }, {"id": "3641", "parent_id": "2121", "name": "Гнівань", "areas": []}, {
                        "id": "3334",
                        "parent_id": "2121",
                        "name": "Жмеринка",
                        "areas": []
                    }, {"id": "3335", "parent_id": "2121", "name": "Іллінці", "areas": []}, {
                        "id": "3336",
                        "parent_id": "2121",
                        "name": "Козятин",
                        "areas": []
                    }, {"id": "3337", "parent_id": "2121", "name": "Калинівка", "areas": []}, {
                        "id": "3338",
                        "parent_id": "2121",
                        "name": "Крижопіль",
                        "areas": []
                    }, {"id": "3339", "parent_id": "2121", "name": "Ладижин", "areas": []}, {
                        "id": "3340",
                        "parent_id": "2121",
                        "name": "Липовець",
                        "areas": []
                    }, {"id": "3341", "parent_id": " 2121 ", "name": " Літин ", "areas ": []}, {
                        "id": " 3342 ",
                        "parent_id": " 2121 ",
                        "name": " Могилів-Подільський ",
                        "areas": []
                    }, {"id": " 3343 ", "parent_id": "2121", "name": "Муровані Курилівці", "areas": []}, {
                        "id": "3344",
                        "parent_id": "2121",
                        "name": "Немирів",
                        "areas": []
                    }, {"id": "3345", "parent_id": "2121", "name": "Оратів", "areas": []}, {
                        "id": "3346",
                        "parent_id": "2121",
                        "name": "Піщанка",
                        "areas": []
                    }, {"id": "3347", "parent_id": "2121", "name": "Погребище", "areas": []}, {
                        "id": "3348",
                        "parent_id": "2121",
                        "name": "Теплик",
                        "areas": []
                    }, {"id": "3349", "parent_id": "2121", "name": " Томашпіль ", "areas": []}, {
                        "id": " 3350 ",
                        "parent_id": " 2121 ",
                        "name": " Тростянець (Вінницька область) ",
                        "areas": []
                    }, {"id": " 3351 ", "parent_id": " 2121 ", "name": " Тульчин ", "areas": []}, {
                        "id": " 3352 ",
                        "parent_id": " 2121 ",
                        "name": " Тиврів ",
                        "areas": []
                    }, {"id": " 3353 ", "parent_id": " 2121 ", "name": " Хмільник ", "areas": []}, {
                        "id": " 3354 ",
                        "parent_id": " 2121 ",
                        "name": " Чечельник ",
                        "areas": []
                    }, {"id": " 3355 ", "parent_id": " 2121 ", "name": "Шаргород", "areas": []}, {
                        "id": "3356",
                        "parent_id": "2121",
                        "name": "Ямпіль (Вінницька область)",
                        "areas": []
                    }]
                }, {
                    "id": "2123",
                    "name": " 5 ",
                    "name": " Волинська область ",
                    "areas": [{"id": " 3634 ", "parent_id": " 2123 ", "name": " Берестечко ", "areas": []}, {
                        "id": "3604",
                        "parent_id": "2123",
                        "name": "Володимир-Волинський",
                        "areas": []
                    }, {"id": "3605", "name": " 2123 ", "name": " Горохів ", "areas": []}, {
                        "id": " 3606 ",
                        "parent_id": " 2123 ",
                        "name": " Іваничі ",
                        "areas": []
                    }, {"id": " 3607 ", "parent_id": " 2123 ", "name": " Камінь-Каширський ", "areas": []}, {
                        "id": " 3608 ",
                        "parent_id": "2123",
                        "name": "Ківерці",
                        "areas": []
                    }, {"id": "2124", "parent_id": "2123", "name": "Ковель", "areas": []}, {
                        "id": "3609 ",
                        "parent_id": " 2123 ",
                        "name": " Локачі ",
                        "areas": []
                    }, {"id": " 124 ", "parent_id": " 2123 ", "name": " Луцьк ", "areas": []}, {
                        "id": " 3610 ",
                        "parent_id": " 2123 ",
                        "name": " Любешів ",
                        "areas": []
                    }, {"id": " 3611 ", "parent_id": " 2123 ", "name": " Любомль ", "areas": []}, {
                        "id": " 3612 ",
                        "parent_id": " 2123 ",
                        "name": " Маневичі ",
                        "areas ": []
                    }, {"id": " 3613 ", "parent_id": " 2123 ", "name": " Нововолинськ ", "areas": []}, {
                        "id": " 3614 ",
                        "parent_id": " 2123 ",
                        "name": " Ратне ",
                        "areas": []
                    }, {"id": " 3615 ", "parent_id": " 2123 ", "name": " Рожище ", "areas": []}, {
                        "id": " 3616 ",
                        "parent_id": " 2123 ",
                        "name": " Стара Вижівка ",
                        "areas": []
                    }, {"id": " 3617 ", "parent_id": " 2123 ", "name": "Турійськ ", "areas": []}, {
                        "id": " 3652 ",
                        "parent_id": " 2123 ",
                        "name": " Устилуг ",
                        "areas": []
                    }, {"id": " 3618 ", "parent_id": " 2123 ", "name": " Шацьк (Волинська область) ", "areas": []}]
                }, {
                    "id": " 2126 ",
                    "parent_id": " 5 ",
                    "name": "Дніпропетровська область",
                    "areas": [{"id": "3132", "parent_id": "2126", "name": "Апостолово", "areas": []}, {
                        "id": " 3133 ",
                        "parent_id": "2126 ",
                        "name": " Васильківка ",
                        "areas": []
                    }, {"id": " 2717 ", "parent_id": " 2126 ", "name": " Верхньодніпровськ ", "areas": []}, {
                        "id": "3621",
                        "parent_id": "2126",
                        "name": "Верхівцеве",
                        "areas": []
                    }, {"id": "2716", "parent_id": "2126 ", "name": " Вольногорськ ", "areas": []}, {
                        "id": " 117 ",
                        "parent_id": " 2126 ",
                        "name": " Дніпро (Дніпропетровськ) ",
                        "areas": []
                    }, {"id": "2127", "parent_id": "2126", "name": "Дніпродзержинськ", "areas": []}, {
                        "id": "2129",
                        "parent_id": "2126",
                        "name": "Жовті Води",
                        "areas": []
                    }, {
                        "id": "3134",
                        "parent_id": "2126",
                        "name": "Зеленодольськ (Дніпропетровська область)",
                        "areas": []
                    }, {"id": "2101", "parent_id": "2126", "name": "Кривий Ріг", "areas": []}, {
                        "id": "3135",
                        "name": " 2126 ",
                        "name": " Кринички ",
                        "areas": []
                    }, {"id": " 3136 ", "parent_id": " 2126 ", "name": " Магдалинівка ", "areas": []}, {
                        "id": " 3137 ",
                        "parent_id": " 2126 ",
                        "name": " Марганець ",
                        "areas": []
                    }, {"id": " 3138 ", "parent_id": " 2126 ", "name": " Межова ", "areas": []}, {
                        "id": " 2131 ",
                        "parent_id": " 2126 ",
                        "name": " Нікополь ",
                        "areas": []
                    }, {
                        "id": "2132",
                        "parent_id": "2126",
                        "name": "Новомосковськ (Дніпропетровська область)",
                        "areas": []
                    }, {"id": "3139", "parent_id": "2126", "name": "Покров (Дніпропетровська область)", "areas": []}, {
                        "id": "2133",
                        "parent_id": "2126",
                        "name": " Павлоград ",
                        "areas": []
                    }, {"id": " 3645 ", "parent_id": " 2126 ", "name": " Перещепине ", "areas": []}, {
                        "id": "3072",
                        "parent_id": "2126",
                        "name": "Першотравенськ",
                        "areas": []
                    }, {"id": "3141", "parent_id": "2126", "name": "Петриківка", "areas": []}, {
                        "id": "3142",
                        "parent_id": "2126",
                        "name": "Петропавлівка",
                        "areas": []
                    }, {"id": "3646", "parent_id": "2126", "name": "Підгородне", "areas": []}, {
                        "id": "3143",
                        "parent_id": " 2126 ",
                        "name": "Покровське ",
                        "areas": []
                    }, {"id": " 3144 ", "parent_id": " 2126 ", "name": " П'ятихатки ", "areas": []}, {
                        "id": " 3145 ",
                        "parent_id": " 2126 ",
                        "name": " Синельникове ",
                        "areas": []
                    }, {"id": " 3146 ", "parent_id": " 2126 ", "name": " Солоне ", "areas": []}, {
                        "id": " 3147 ",
                        "parent_id": " 2126 ",
                        "name": " Софіївка ",
                        "areas": []
                    }, {"id": " 3148 ", "parent_id": "2126 ", "name": " Тернівка ", "areas": []}, {
                        "id": " 3149 ",
                        "parent_id": " 2126 ",
                        "name": " Томаківка ",
                        "areas": []
                    }, {"id": "3150", "parent_id": "2126", "name": "Царичанка", "areas": []}, {
                        "id": "3151",
                        "parent_id": "2126 ",
                        "name": " Широке ",
                        "areas": []
                    }, {"id": " 3152 ", "parent_id": " 2126 ", "name": " Юр'ївка ", "areas": []}]
                }, {
                    "id": "2134",
                    "parent_id": "5",
                    "name": "Донецька область",
                    "areas": [{"id": "3238", "parent_id": "2134", "name": " Авдіївка ", "areas": []}, {
                        "id": " 3239 ",
                        "parent_id": " 2134 ",
                        "name": " Олександрівка (Донецька область) ",
                        "areas": []
                    }, {"id": "3240", "parent_id": "2134", "name": "Амвросіївка", "areas": []}, {
                        "id": "3630",
                        "parent_id": "2134",
                        "name": "Артемово",
                        "areas": []
                    }, {"id": "2135", "parent_id": "2134", "name": "Артемівськ (Україна)", "areas": []}, {
                        "id": " 3633 ",
                        "parent_id": " 2134 ",
                        "name": " Білицьке ",
                        "areas": []
                    }, {"id": " 3242 ", "parent_id": " 2134 ", "name": " Білозерське ", "areas": []}, {
                        "id": " 3243 ",
                        "parent_id": " 2134 ",
                        "name": " Велика Новосілка ",
                        "areas": []
                    }, {"id": " 3244 ", "name": " 2134 ", "name": " Волноваха ", "areas": []}, {
                        "id": " 3245 ",
                        "parent_id": " 2134 ",
                        "name": " Володарське (Донецька область) ",
                        "areas": []
                    }, {"id": " 2136 ", "parent_id": " 2134 ", "name": " Горлівка ", "areas": []}, {
                        "id": " 3246 ",
                        "parent_id": " 2134 ",
                        "name": " Дебальцеве ",
                        "areas": []
                    }, {
                        "id": " 3247 ",
                        "parent_id": " 2134 ",
                        "name": "Дзержинськ (Донецька область) ",
                        "areas": []
                    }, {"id": " 3248 ", "parent_id": " 2134 ", "name": " Димитров ", "areas": []}, {
                        "id": " 3249 ",
                        "parent_id": " 2134 ",
                        "name": " Добропілля ",
                        "areas": []
                    }, {"id": " 3250 ", "parent_id": " 2134 ", "name": " Докучаєвськ ", "areas": []}, {
                        "id": " 118 ",
                        "parent_id": " 2134 ",
                        "name": " Донецьк (Україна) ",
                        "areas": []
                    }, {"id": "2508", "name": " 2134 ", "name": " Дружківка ", "areas": []}, {
                        "id": " 2138 ",
                        "parent_id": " 2134 ",
                        "name": " Єнакієво ",
                        "areas": []
                    }, {"id": " 3251 ", "parent_id": " 2134 ", "name": " Зугрес ", "areas": []}, {
                        "id": " 3253 ",
                        "parent_id": " 2134 ",
                        "name": " Кіровське (Донецька область) ",
                        "areas": []
                    }, {"id": " 2656 ", "parent_id": " 2134 ", "name": " Костянтинівка ", "areas": []}, {
                        "id": "2139",
                        "parent_id": "2134",
                        "name": "Краматорськ",
                        "areas": []
                    }, {"id": "3255", "parent_id": "2134", "name": "Червоний Лиман", "areas": []}, {
                        "id": "3619",
                        "parent_id": "2134",
                        "name": "Курахове",
                        "areas": []
                    }, {"id": "2140", "parent_id": "2134", "name": "Макіївка", "areas": []}, {
                        "id": "3256",
                        "parent_id": "2134",
                        "name": " Мангуш ",
                        "areas": []
                    }, {"id": " 2104 ", "parent_id": " 2134 ", "name": " Маріуполь ", "areas": []}, {
                        "id": " 3258 ",
                        "parent_id": " 2134 ",
                        "name": " Мар'їнка ",
                        "areas": []
                    }, {"id": " 3259 ", "parent_id": " 2134 ", "name": " Моспине ", "areas": []}, {
                        "id": " 3260 ",
                        "parent_id": " 2134 ",
                        "name": " Новоазовськ ",
                        "areas": []
                    }, {"id": " 3262 ", "parent_id": "2134", "name": "Новогродівка", "areas": []}, {
                        "id": "3254",
                        "parent_id": "2134",
                        "name": "Покровск (Донецька область)",
                        "areas": []
                    }, {"id": " 3263 ", "parent_id": " 2134 ", "name": " Родинське ", "areas": []}, {
                        "id": " 3241 ",
                        "parent_id": " 2134 ",
                        "name": " Світлодарськ ",
                        "areas": []
                    }, {"id": " 3626 ", "parent_id": " 2134 ", "name": " Святогірськ ", "areas": []}, {
                        "id": "3784",
                        "parent_id": "2134",
                        "name": "Сіверські (Донецька область)",
                        "areas": []
                    }, {"id": "3264", "parent_id": "2134", "name": "Селидове", "areas": []}, {
                        "id": "2142",
                        "parent_id": "2134",
                        "name": "Слов'янськ",
                        "areas": []
                    }, {"id": "2143", "parent_id": "2134", "name": "Сніжне", "areas": []}, {
                        "id": "3265",
                        "parent_id": "2134",
                        "name": "Соледар ",
                        "areas": []
                    }, {"id": " 3266 ", "parent_id": " 2134 ", "name": " Старобешеве ", "areas": []}, {
                        "id": " 3268 ",
                        "parent_id": " 2134 ",
                        "name": " Тельманове ",
                        "areas": []
                    }, {"id": " 2144 ", "parent_id": " 2134 ", "name": " Торез ", "areas": []}, {
                        "id": " 3269 ",
                        "parent_id": " 2134 ",
                        "name": " Вугледар ",
                        "areas": []
                    }, {"id": " 2145 ", "parent_id": " 2134 ", "name": "Харцизьк", "areas": []}, {
                        "id": "2146",
                        "parent_id": "2134",
                        "name": "Шахтарськ (Україна)",
                        "areas": []
                    }, {"id": "2509", "parent_id": "2134", "name": "Ясинувата", "areas": []}]
                }, {
                    "id": "2147",
                    "parent_id": "5",
                    "name": "Житомирська область",
                    "areas": [{"id": "3554", "parent_id": "2147", "name": "Андрушівка", "areas": []}, {
                        "id": "3555",
                        "name": " 2147 ",
                        "name": " Баранівка ",
                        "areas": []
                    }, {"id": " 2148 ", "parent_id": " 2147 ", "name": " Бердичів ", "areas": []}, {
                        "id": " 3556 ",
                        "parent_id": " 2147 ",
                        "name": " Брусилів ",
                        "areas": []
                    }, {"id": " 3557 ", "parent_id": " 2147 ", "name": " Володарськ-Волинський ", "areas": []}, {
                        "id": " 3558 ",
                        "parent_id": " 2147 ",
                        "name": " Дзержинськ (Житомирська область ) ",
                        "areas": []
                    }, {"id": "3559", "parent_id": "2147", "name": "Ємільчине", "areas": []}, {
                        "id": "119",
                        "parent_id": "2147",
                        "name": "Житомир",
                        "areas": []
                    }, {"id": "3560", "parent_id": "2147", "name": "Іршанськ", "areas": []}, {
                        "id": " 2150 ",
                        "parent_id": " 2147 ",
                        "name": " Коростень ",
                        "areas": []
                    }, {"id": " 3561 ", "parent_id": " 2147 ", "name": " Коростишів ", "areas": []}, {
                        "id": " 3562 ",
                        "parent_id": " 2147 ",
                        "name": " Лугини ",
                        "areas": []
                    }, {"id": " 3563 ", "parent_id": " 2147 ", "name": " Любар ", "areas": []}, {
                        "id": " 3067 ",
                        "parent_id": " 2147 ",
                        "name": " Малин ",
                        "areas": []
                    }, {"id": " 3564 ", "parent_id": " 2147 ", "name": " Народичі ", "areas": []}, {
                        "id": " 2151 ",
                        "parent_id": "2147",
                        "name": "Новоград-Волинський",
                        "areas": []
                    }, {"id": "3565", "parent_id": "2147", "name": "Овруч", "areas": []}, {
                        "id": "3566",
                        "parent_id": "2147",
                        "name": "Олевськ",
                        "areas": []
                    }, {"id": "3567", "parent_id": "2147", "name": "Попільня", "areas": []}, {
                        "id": "2713",
                        "parent_id": "2147",
                        "name": "Радомишль",
                        "areas": []
                    }, {"id": " 3568 ", "parent_id": " 2147 ", "name": " Романов ", "areas": []}, {
                        "id": " 3569 ",
                        "parent_id": " 2147 ",
                        "name": " Ружин ",
                        "areas": []
                    }, {"id": " 3570 ", "parent_id": " 2147 ", "name": " Червоноармійська ", "areas": []}, {
                        "id": " 3571 ",
                        "parent_id": " 2147 ",
                        "name": " Черняхів ",
                        "areas": []
                    }, {"id": " 3572 ", "parent_id": " 2147 ", "name": "Чуднов", "areas": []}]
                }, {
                    "id": "2152",
                    "parent_id": "5",
                    "name": "Закарпатська область",
                    "areas": [{"id": "3592", "parent_id": "2152", "name": " Берегово ", "areas": []}, {
                        "id": " 3593 ",
                        "parent_id": " 2152 ",
                        "name": " Великий Березний ",
                        "areas": []
                    }, {"id": " 3594 ", "parent_id": " 2152 ", "name": " Виноградів ", "areas": []}, {
                        "id": " 3595 ",
                        "parent_id": " 2152 ",
                        "name": "Воловець ",
                        "areas": []
                    }, {"id": " 3596 ", "parent_id": " 2152 ", "name": " Іршава ", "areas": []}, {
                        "id": " 3597 ",
                        "parent_id": " 2152 ",
                        "name": " Міжгір'я (Закарпатська область) ",
                        "areas": []
                    }, {"id": " 2153 ", "parent_id": " 2152 ", "name": " Мукачево ", "areas": []}, {
                        "id": " 3598 ",
                        "parent_id": " 2152 ",
                        "name": " Перечин ",
                        "areas": []
                    }, {"id": " 3599 ", "parent_id": "2152", "name": "Рахів", "areas": []}, {
                        "id": "3600",
                        "parent_id": "2152",
                        "name": "Свалява",
                        "areas": []
                    }, {"id": "3601", "parent_id": "2152", "name": "Тячів", "areas": []}, {
                        "id": "134",
                        "parent_id": "2152",
                        "name": "Ужгород",
                        "areas": []
                    }, {"id": "3602", "parent_id": "2152", "name": "Хуст", "areas": []}, {
                        "id": "3603",
                        "parent_id": "+2152",
                        "name": "Чоп",
                        "areas": []
                    }]
                }, {
                    "id": "2155",
                    "parent_id": "5",
                    "name": "Запорізька область ",
                    "areas": [{"id": " 3201 ", "parent_id": " 2155 ", "name": " Якимівка ", "areas": []}, {
                        "id": " 2156 ",
                        "parent_id": " 2155 ",
                        "name": " Бердянськ ",
                        "areas": []
                    }, {"id": " 3202 ", "parent_id": " 2155 ", "name": " Велика Білозерка ", "areas ": []}, {
                        "id": " 3203 ",
                        "parent_id": " 2155 ",
                        "name": " Василівка ",
                        "areas": []
                    }, {"id": " 3205 ", "parent_id": " 2155 ", "name": " Веселе ", "areas": []}, {
                        "id": " 3206 ",
                        "parent_id": " 2155 ",
                        "name": " Вільнянськ ",
                        "areas": []
                    }, {"id": " 2720 ", "parent_id": " 2155 ", "name": " Гуляйполе ", "areas": []}, {
                        "id": " 3207 ",
                        "parent_id": " 2155 ",
                        "name": "Дніпрорудне",
                        "areas": []
                    }, {"id": "120", "parent_id": "2155", "name": "Запоріжжя", "areas": []}, {
                        "id": "3208",
                        "parent_id": "2155",
                        "name": "Кам'янка-Дніпровська",
                        "areas": []
                    }, {"id": "3209", "parent_id": "2155", "name": "Кирилівка", "areas": []}, {
                        "id": "2718",
                        "parent_id": "2155",
                        "name": "Куйбишево",
                        "areas": []
                    }, {"id": "2158", "parent_id": "2155", "name": "Мелітополь", "areas": []}, {
                        "id": "3210",
                        "parent_id": "2155",
                        "name": " Михайлівка (Запорізька область) ",
                        "areas": []
                    }, {"id": " 3644 ", "parent_id": " 2155 ", "name": " Молочанськ ", "areas": []}, {
                        "id": " 2719 ",
                        "parent_id": " 2155 ",
                        "name": " Новомиколаївка ",
                        "areas": []
                    }, {"id": " 3211 ", "parent_id": " 2155 ", "name": " Орєхов ", "areas ": []}, {
                        "id": " 3212 ",
                        "parent_id": " 2155 ",
                        "name": " Пологи ",
                        "areas": []
                    }, {"id": " 3213 ", "parent_id": " 2155 ", "name": " Приазовське ", "areas": []}, {
                        "id": " 3214 ",
                        "parent_id": " 2155 ",
                        "name": " Приморськ (Запорізька область) ",
                        "areas": []
                    }, {"id": " 2 721 ", "parent_id": " 2155 ", "name": " Розівка ", "areas": []}, {
                        "id": " 3215 ",
                        "parent_id": "2155 ",
                        "name": " Токмак ",
                        "areas": []
                    }, {"id": " 3216 ", "parent_id": " 2155 ", "name": " Чернігівка ", "areas": []}, {
                        "id": "2159",
                        "parent_id": "2155",
                        "name": "Енергодар",
                        "areas": []
                    }]
                }, {
                    "id": "2160",
                    "parent_id": "5",
                    "name": "Івано-Франківська область",
                    "areas": [{"id": "3447", "parent_id": "2160", "name": "Богородчани", "areas": []}, {
                        "id": " 3448 ",
                        "parent_id": " 2160 ",
                        "name": " Болехів ",
                        "areas": []
                    }, {"id": " 3449 ", "parent_id": " 2160 ", "name": " Бурштин ", "areas": []}, {
                        "id": " 3450 ",
                        "parent_id": " 2160 ",
                        "name": " Верховина ",
                        "areas": []
                    }, {
                        "id": " 3451 ",
                        "parent_id": " 2160 ",
                        "name": " Галич (Івано-Франківська область) ",
                        "areas": []
                    }, {"id": " 3452 ", "parent_id": "2160 ", "name": " Городенка ", "areas": []}, {
                        "id": " 3453 ",
                        "parent_id": " 2160 ",
                        "name": " Долина ",
                        "areas": []
                    }, {"id": "121", "parent_id": "2160", "name": "Івано-Франківськ", "areas": []}, {
                        "id": "2162",
                        "parent_id": "2160",
                        "name": "Калуш",
                        "areas": []
                    }, {"id": "2163", "parent_id": "2160", "name": "Коломия", "areas": []}, {
                        "id": "3454",
                        "parent_id": "2160",
                        "name": "Косів",
                        "areas": []
                    }, {"id": "3455", "parent_id": "2160", "name": "Надвірна", "areas": []}, {
                        "id": " 3456 ",
                        "parent_id": " 2160 ",
                        "name": " Перегінське ",
                        "areas": []
                    }, {"id": " 3457 ", "parent_id": " 2160 ", "name": " Поляниця ", "areas": []}, {
                        "id": " 3458 ",
                        "parent_id": " 2160 ",
                        "name": " Рогатин ",
                        "areas ": []
                    }, {"id": " 3459 ", "parent_id": " 2160 ", "name": " Рожнятів ", "areas": []}, {
                        "id": " 3460 ",
                        "parent_id": " 2160 ",
                        "name": " Снятин ",
                        "areas": []
                    }, {"id": " 3461 ", "parent_id": " 2160 ", "name": " Тлумач ", "areas": []}, {
                        "id": " 3462 ",
                        "parent_id": " 2160 ",
                        "name": " Тисмениця ",
                        "areas": []
                    }, {"id": " 3463 ", "parent_id": " 2160 ", "name": " Яремче ", "areas": []}]
                }, {"id": "115", "parent_id": "5", "name": "Київ", "areas": []}, {
                    "id": "2164 ",
                    "parent_id": " 5 ",
                    "name": " Київська область ",
                    "areas": [{"id": " 3078 ", "parent_id": " 2164 ", "name": " Баришівка ", "areas": []}, {
                        "id": " 2165 ",
                        "parent_id": " 2164 ",
                        "name": " Біла Церква ",
                        "areas": []
                    }, {"id": " 3079 ", "parent_id": "2164", "name": "Білогородка", "areas": []}, {
                        "id": "3080",
                        "parent_id": "2164",
                        "name": "Березань",
                        "areas": []
                    }, {"id": "3081", "parent_id": "2164", "name": "Богуслав", "areas": []}, {
                        "id": "2166",
                        "parent_id": "2164",
                        "name": "Бориспіль",
                        "areas": []
                    }, {"id": "3082", "parent_id": "2164", "name": "Бородянка", "areas": []}, {
                        "id": "2445",
                        "parent_id": " 2164 ",
                        "name": " Боярка ",
                        "areas": []
                    }, {"id": " 2167 ", "parent_id": " 2164 ", "name": " Бровари ", "areas": []}, {
                        "id": " 3083 ",
                        "parent_id": " 2164 ",
                        "name": " Буча ",
                        "areas": []
                    }, {"id": " 3084 ", "parent_id": " 2164 ", "name": " Васильків ", "areas": []}, {
                        "id": " 3085 ",
                        "parent_id": " 2164 ",
                        "name": " Вишневе ",
                        "areas": []
                    }, {"id": " 3086 ", "parent_id": "2164", "name": "Володарка", "areas": []}, {
                        "id": "3087",
                        "parent_id": "2164",
                        "name": "Ворзель",
                        "areas": []
                    }, {"id": "3088", "parent_id": "2164", "name": "Вишгород", "areas": []}, {
                        "id": "3089",
                        "parent_id": " 2164 ",
                        "name": " Гнідин ",
                        "areas": []
                    }, {"id": " 2434 ", "parent_id": " 2164 ", "name": " Гостомель ", "areas": []}, {
                        "id": "3090",
                        "parent_id": "2164",
                        "name": "Згурівка",
                        "areas": []
                    }, {"id": "3091", "parent_id": "2164", "name": "Іванків", "areas": []}, {
                        "id": " 3092 ",
                        "parent_id": " 2164 ",
                        "name": " Ірпінь ",
                        "areas": []
                    }, {"id": " 2676 ", "parent_id": " 2164 ", "name": " Кагарлик ", "areas": []}, {
                        "id": " 3093 ",
                        "parent_id": " 2164 ",
                        "name": " Макарів (Київська область) ",
                        "areas": []
                    }, {"id": "3094", "parent_id": "2164", "name": "Миронівка", "areas": []}, {
                        "id": "2673",
                        "parent_id": "2164",
                        "name": "Обухів",
                        "areas": []
                    }, {"id": "3095", "parent_id": "2164", "name": "Переяслав-Хмельницький", "areas": []}, {
                        "id": "3096",
                        "parent_id": "2164",
                        "name": "Петрівське",
                        "areas": []
                    }, {"id": "3097", "parent_id": "2164", "name": "Поліське", "areas": []}, {
                        "id": "3098",
                        "parent_id": "2164",
                        "name": "Рокитне (Київська область)",
                        "areas": []
                    }, {"id": "2675", "parent_id": "2164", "name": "Ржищів", "areas": []}, {
                        "id": "3099",
                        "parent_id": " 2164 ",
                        "name": " Сквира ",
                        "areas": []
                    }, {"id": " 3100 ", "parent_id": " 2164 ", "name": " Славутич ", "areas": []}, {
                        "id": "3101",
                        "parent_id": "2164",
                        "name": "Ставище",
                        "areas": []
                    }, {"id": "3102", "parent_id": "2164", "name": "Стоянка", "areas": []}, {
                        "id": " 3103 ",
                        "parent_id": " 2164 ",
                        "name": " Тараща ",
                        "areas": []
                    }, {"id": " 3104 ", "parent_id": " 2164 ", "name": " Тетіїв ", "areas": []}, {
                        "id": " 3105 ",
                        "parent_id": " 2164 ",
                        "name": " Узин ",
                        "areas": []
                    }, {"id": "2674", "parent_id": "2164", "name": "Українка", "areas": []}, {
                        "id": "2168",
                        "parent_id": "2164",
                        "name": "Фастів",
                        "areas": []
                    }, {"id": "3106", "parent_id": "2164", "name": "Чабани", "areas": []}, {
                        "id": "3107",
                        "parent_id": "2164",
                        "name": "Яготин",
                        "areas": []
                    }]
                }, {
                    "id": "2169",
                    "parent_id": "5",
                    "name": " Кіровоградська область ",
                    "areas": [{
                        "id": " 2170 ",
                        "parent_id": " 2169 ",
                        "name": " Олександрія (Кіровоградська область) ",
                        "areas": []
                    }, {
                        "id": "3525",
                        "parent_id": "2169",
                        "name": "Олександрівка (Кіровоградська область)",
                        "areas": []
                    }, {"id": "3526", "parent_id": "2169", "name": "Бобринець", "areas": []}, {
                        "id": "3527",
                        "parent_id": "2169",
                        "name": "Гайворон",
                        "areas": []
                    }, {"id": "3528", "parent_id": "2169", "name": "Голованівськ", "areas": []}, {
                        "id": "3529",
                        "parent_id": "2169",
                        "name": "Добровеличківка",
                        "areas": []
                    }, {"id": "3530", "parent_id": "2169", "name": " Долинська ", "areas": []}, {
                        "id": " 2715 ",
                        "parent_id": " 2169 ",
                        "name": " Знам'янка ",
                        "areas": []
                    }, {"id": " 122 ", "parent_id": "2169", "name": "Кіровоград", "areas": []}, {
                        "id": "3531",
                        "parent_id": "2169",
                        "name": "Компаніївка",
                        "areas": []
                    }, {"id": "3532", "parent_id": "2169", "name": "Мала Виска", "areas": []}, {
                        "id": "3533",
                        "parent_id": "2169",
                        "name": "Новгородка",
                        "areas": []
                    }, {"id": "3534", "parent_id": "2169", "name": "Новоархангельськ", "areas": []}, {
                        "id": "3535 ",
                        "parent_id": " 2169 ",
                        "name": " Новомиргород ",
                        "areas": []
                    }, {"id": " 3536 ", "parent_id": " 2169 ", "name": " Новоукраїнка ", "areas": []}, {
                        "id": " 3537 ",
                        "parent_id": " 2169 ",
                        "name": " Вільшанка ",
                        "areas": []
                    }, {"id": " 3538 ", "parent_id": " 2169 ", "name": " Онуфріївка ", "areas": []}, {
                        "id": " 3539 ",
                        "parent_id": " 2169 ",
                        "name": " Петрово ",
                        "areas": []
                    }, {"id": "2172", "parent_id": "2169", "name": "Світловодськ", "areas": []}, {
                        "id": "3540",
                        "parent_id": "2169",
                        "name": "Ульянівка (Кіровоградська область)",
                        "areas": []
                    }, {"id": "3541", "parent_id": "2169", "name": " Устинівка ", "areas": []}]
                }, {
                    "id": " 2173 ",
                    "parent_id": " 5 ",
                    "name": " Луганська область ",
                    "areas": [{
                        "id": " 3628 ",
                        "name": " 2173 ",
                        "name": " Олександрівськ (Луганська область) ",
                        "areas": []
                    }, {"id": " 3629 ", "parent_id": " 2173 ", "name": " Алмазна ", "areas": []}, {
                        "id": " 2174 ",
                        "parent_id": " 2173 ",
                        "name": " Алчевськ ",
                        "areas": []
                    }, {"id": " 3374 ", "parent_id": " 2173 ", "name": " Антрацит ", "areas": []}, {
                        "id": " 3375 ",
                        "parent_id": " 2173 ",
                        "name": " Біловодськ ",
                        "areas ": []
                    }, {"id": " 3376 ", "parent_id": " 2173 ", "name": " Білокуракине ", "areas": []}, {
                        "id": " 3377 ",
                        "parent_id": " 2173 ",
                        "name": " Брянка ",
                        "areas": []
                    }, {"id": " 3378 ", "parent_id": " 2173 ", "name": " Кіровськ ", "areas": []}, {
                        "id": " 3379 ",
                        "parent_id": " 2173 ",
                        "name": " Краснодон ",
                        "areas": []
                    }, {"id": " 2175 ", "parent_id": " 2173 ", "name": "Красний Луч ", "areas": []}, {
                        "id": " 3380 ",
                        "parent_id": " 2173 ",
                        "name": " Кремінна ",
                        "areas": []
                    }, {"id": "2176", "parent_id": "2173", "name": "Лисичанськ", "areas": []}, {
                        "id": "123",
                        "parent_id": "2173",
                        "name": " Луганськ ",
                        "areas": []
                    }, {"id": " 3381 ", "parent_id": " 2173 ", "name": " Лутугине ", "areas": []}, {
                        "id": " 3382 ",
                        "parent_id": "2173 ",
                        "name": " Марківка ",
                        "areas": []
                    }, {"id": " 3383 ", "parent_id": " 2173 ", "name": " Мілове ", "areas": []}, {
                        "id": "3384",
                        "parent_id": "2173",
                        "name": "Новоайдар",
                        "areas": []
                    }, {"id": "3385", "parent_id": "2173 ", "name": " Новопсков ", "areas": []}, {
                        "id": " 3386 ",
                        "parent_id": " 2173 ",
                        "name": " Перевальськ ",
                        "areas": []
                    }, {"id": "3387", "parent_id": "2173", "name": "Попасна", "areas": []}, {
                        "id": "3388",
                        "parent_id": "2173",
                        "name": " Ровеньки ",
                        "areas": []
                    }, {"id": " 2513 ", "parent_id": " 2173 ", "name": " Рубіжне ", "areas": []}, {
                        "id": " 3389 ",
                        "parent_id": " 2173 ",
                        "name": " Сватове ",
                        "areas": []
                    }, {"id": " 2958 ", "parent_id": " 2173 ", "name": " Свердловськ ", "areas": []}, {
                        "id": "2178",
                        "parent_id": "2173",
                        "name": "Сєвєродонецьк",
                        "areas": []
                    }, {"id": "3390", "parent_id": "2173", "name": "Слов'яносербськ", "areas": []}, {
                        "id": "3391",
                        "parent_id": "2173",
                        "name": "Станиця Луганська",
                        "areas": []
                    }, {"id": "3392", "parent_id": "2173", "name": "Старобільськ", "areas": []}, {
                        "id": "2179",
                        "parent_id": "2173",
                        "name": "Стаханов",
                        "areas": []
                    }, {"id": "3627", "parent_id": "2173", "name": "Щастя", "areas": []}, {
                        "id": "3393",
                        "parent_id": "2173",
                        "name": "Троїцьке",
                        "areas": []
                    }, {"id": "3655", "parent_id": "2173", "name": " Червонопартизанськ ", "areas": []}]
                }, {
                    "id": " 2180 ",
                    "parent_id": " 5 ",
                    "name": " Львівська область ",
                    "areas": [{"id": " 3632 ", "name": " 2180 ", "name": " Белз ", "areas": []}, {
                        "id": " 3635 ",
                        "parent_id": " 2180 ",
                        "name": " Бібрка ",
                        "areas": []
                    }, {"id": " 3178 ", "parent_id": " 2180 ", "name": " Борислав ", "areas": []}, {
                        "id": " 3179 ",
                        "parent_id": " 2180 ",
                        "name": " Броди ",
                        "areas": []
                    }, {"id": " 3180 ", "parent_id": " 2180 ", "name": " Буськ ", "areas": []}, {
                        "id": "3637",
                        "parent_id": "2180",
                        "name": "Великі Мости",
                        "areas": []
                    }, {"id": "3622", "parent_id": "2180", "name": "Винники", "areas": []}, {
                        "id": "3640",
                        "parent_id": "2180",
                        "name": "Глиняни",
                        "areas": []
                    }, {"id": "3181", "parent_id": "2180", "name": "Городок (Львівська область)", "areas": []}, {
                        "id": "3182",
                        "parent_id": "2180",
                        "name": "Добромиль",
                        "areas": []
                    }, {"id": "2181", "parent_id": "2180", "name": "Дрогобич", "areas": []}, {
                        "id": "3643",
                        "parent_id": "2180",
                        "name": "Дубляни",
                        "areas": []
                    }, {"id": "3183", "parent_id": "2180", "name": " Жидачів ", "areas": []}, {
                        "id": " 3184 ",
                        "parent_id": " 2180 ",
                        "name": " Жовква ",
                        "areas": []
                    }, {
                        "id": " 3185 ",
                        "parent_id": "2180 ",
                        "name": " Золочів (Львівська область) ",
                        "areas": []
                    }, {"id": " 2714 ", "parent_id": " 2180 ", "name": " Кам'янка-Бузька ", "areas": []}, {
                        "id": "125",
                        "parent_id": "2180",
                        "name": "Львів",
                        "areas": []
                    }, {"id": "3186", "parent_id": "2180", "name": "Моршин", "areas": []}, {
                        "id": "3187",
                        "parent_id": "2180",
                        "name": "Мостиська",
                        "areas": []
                    }, {"id": "3188", "parent_id": "2180", "name": "Новояворівськ", "areas": []}, {
                        "id": "3189",
                        "parent_id": "2180",
                        "name": "Перемишляни",
                        "areas": []
                    }, {"id": "3190", "parent_id": "2180", "name": "Пустомити", "areas": []}, {
                        "id": "3191",
                        "parent_id": "2180",
                        "name": "Рава-Руська",
                        "areas": []
                    }, {"id": "3192", "parent_id": "2180", "name": "Радехів", "areas ": []}, {
                        "id": " 3193 ",
                        "parent_id": " 2180 ",
                        "name": " Розділ ",
                        "areas": []
                    }, {"id": " 3656 ", "parent_id": " 2180 ", "name": " Рудки ", "areas": []}, {
                        "id": " 3194 ",
                        "parent_id": " 2180 ",
                        "name": " Самбір ",
                        "areas": []
                    }, {"id": " 3195 ", "parent_id": " 2180 ", "name": " Сколе ", "areas": []}, {
                        "id": " 3196 ",
                        "parent_id": " 2180 ",
                        "name": " Сокаль ",
                        "areas": []
                    }, {"id": " 3197 ", "parent_id": " 2180 ", "name": " Старий Самбір ", "areas": []}, {
                        "id": "2183",
                        "parent_id": "2180",
                        "name": "Стрий",
                        "areas": []
                    }, {"id": "3198", "parent_id": "2180", "name": " Трускавець ", "areas": []}, {
                        "id": " 3199 ",
                        "parent_id": " 2180 ",
                        "name": " Турка ",
                        "areas": []
                    }, {"id": " 3651 ", "parent_id": "2180", "name": "Угнів", "areas": []}, {
                        "id": "3653",
                        "parent_id": "2180",
                        "name": "Хирів",
                        "areas": []
                    }, {"id": "2184", "parent_id": "2180", "name": "Червоноград", "areas": []}, {
                        "id": "3200",
                        "parent_id": " 2180 ",
                        "name": " Яворів ",
                        "areas": []
                    }]
                }, {
                    "id": " 2185 ",
                    "parent_id": " 5 ",
                    "name": " Миколаївська область ",
                    "areas": [{"id": "3394", "parent_id": "2185", "name": "Арбузинка", "areas": []}, {
                        "id": "3395",
                        "parent_id": "2185",
                        "name": "Баштанка",
                        "areas": []
                    }, {"id": "3396", "parent_id": "2185", "name": "Березанка", "areas": []}, {
                        "id": "3397",
                        "parent_id": "2185",
                        "name": "Березнегувате",
                        "areas": []
                    }, {"id": "3398", "parent_id": "2185", "name": "Братське", "areas": []}, {
                        "id": "3399",
                        "parent_id": "2185",
                        "name": "Веселинове",
                        "areas": []
                    }, {
                        "id": "3400",
                        "parent_id": "2185",
                        "name": "Вознесенськ (Миколаївська область)",
                        "areas": []
                    }, {"id": "3401", "parent_id": "2185", "name": "Врадіївка", "areas": []}, {
                        "id": " 3402 термін ",
                        "parent_id": " 2185 ",
                        "name": " Доманівка ",
                        "areas": []
                    }, {"id": "2724 ", "parent_id": " 2185 ", "name": " Єланець ", "areas": []}, {
                        "id": " 3403 ",
                        "parent_id": " 2185 ",
                        "name": " Казанка ",
                        "areas": []
                    }, {"id": " 3404 ", "parent_id": " 2185 ", "name": " Криве Озеро ", "areas": []}, {
                        "id": " 126 ",
                        "parent_id": " 2185 ",
                        "name": " Миколаїв ",
                        "areas": []
                    }, {"id": " 3405 ", "parent_id": " 2185 ", "name": " Нова Одеса ", "areas": []}, {
                        "id": "3406",
                        "parent_id": "2185",
                        "name": "Новий Буг",
                        "areas": []
                    }, {"id": "3407", "parent_id": "2185", "name": "Очаків", "areas": []}, {
                        "id": "2187",
                        "parent_id": "2185",
                        "name": "Первомайськ (Україна)",
                        "areas": []
                    }, {"id": "3408", "parent_id": "2185", "name": "Снігурівка", "areas": []}, {
                        "id": "2949",
                        "parent_id": " 2185 ",
                        "name": "Южноукраїнськ",
                        "areas": []
                    }]
                }, {
                    "id": "2188",
                    "parent_id": "5",
                    "name": "Одеська область",
                    "areas": [{"id": "3153", "parent_id": "2188", "name": "Ананьїв", "areas": []}, {
                        "id": "3154",
                        "parent_id": "2188",
                        "name": " Арциз ",
                        "areas": []
                    }, {"id": " 3155 ", "parent_id": " 2188 ", "name": " Балта ", "areas": []}, {
                        "id": " 2189 ",
                        "parent_id": "2188",
                        "name": "Білгород-Дністровський",
                        "areas": []
                    }, {"id": "3156", "parent_id": "2188", "name": "Біляївка", "areas": []}, {
                        "id": "3157",
                        "parent_id": "2188",
                        "name": "Березівка (Одеська область)",
                        "areas": []
                    }, {"id": "3158", "parent_id": "2188", "name": "Болград", "areas": []}, {
                        "id": "3159",
                        "parent_id": "2188",
                        "name": "Велика Михайлівка ",
                        "areas": []
                    }, {"id": " 3638 ", "parent_id": " 2188 ", "name": " Вилкове ", "areas": []}, {
                        "id": "3160",
                        "parent_id": "2188",
                        "name": "Іванівка (Одеська область)",
                        "areas": []
                    }, {"id": "2190", "parent_id": "2188", "name": " Ізмаїл ", "areas": []}, {
                        "id": " 2191 ",
                        "parent_id": " 2188 ",
                        "name": " Іллічівськ ",
                        "areas": []
                    }, {"id": " 3161 ", "name": " 2188 ", "name": " Кілія ", "areas": []}, {
                        "id": " 3162 ",
                        "parent_id": " 2188 ",
                        "name": " Кодима ",
                        "areas": []
                    }, {"id": " 3163 ", "parent_id": " 2188 ", "name": " Комінтернівське ", "areas": []}, {
                        "id": " 3164 ",
                        "parent_id": " 2188 ",
                        "name": " Котовськ (Одеська область) ",
                        "areas": []
                    }, {"id": " 3165 ", "parent_id": " 2188 ", "name": " Красні Окни ", "areas": []}, {
                        "id": "3166",
                        "parent_id": "2188",
                        "name": "Любашівка",
                        "areas": []
                    }, {"id": "3168", "parent_id": "2188", "name": "Овідіополь", "areas": []}, {
                        "id": "127",
                        "parent_id": "2188",
                        "name": "Одеса",
                        "areas": []
                    }, {"id": "3169", "parent_id": "2188", "name": "Роздільна", "areas": []}, {
                        "id": "3170",
                        "parent_id": "2188",
                        "name": "Рені",
                        "areas": []
                    }, {"id": "3171", "parent_id": "2188", "name": "Саврань", "areas": []}, {
                        "id": "3172",
                        "parent_id": "2188",
                        "name": "Сарата",
                        "areas": []
                    }, {"id": "3173", "parent_id": "2188", "name": "Тарутине", "areas": []}, {
                        "id": "3174",
                        "parent_id": "2188",
                        "name": "Татарбунари",
                        "areas": []
                    }, {"id": "3650", "parent_id": "2188 ", "name": " Теплодар ", "areas": []}, {
                        "id": " 3175 ",
                        "parent_id": " 2188 ",
                        "name": " Фрунзівка ",
                        "areas": []
                    }, {"id": "3176", "parent_id": "2188", "name": "Ширяєве", "areas": []}, {
                        "id": "3177",
                        "parent_id": "2188 ",
                        "name": " Південний (Одеська область) ",
                        "areas": []
                    }, {"id": " 6057 ", "parent_id": " 2188 ", "name": " Подольск (Одеська область) ", "areas": []}]
                }, {
                    "id": " 2193 ",
                    "parent_id": " 5 ",
                    "name": " Полтавська область ",
                    "areas": [{"id": " 3217 ", "parent_id": " 2193 ", "name": "Велика Багачка", "areas": []}, {
                        "id": "3218",
                        "parent_id": "2193",
                        "name": "Гадяч",
                        "areas": []
                    }, {"id": "3219", "parent_id": "2193", "name": "Глобино", "areas": []}, {
                        "id": "3220",
                        "parent_id": "2193",
                        "name": "Гребінка ",
                        "areas": []
                    }, {"id": " 3221 ", "parent_id": " 2193 ", "name": " Диканька ", "areas": []}, {
                        "id": " 3222 ",
                        "parent_id": " 2193 ",
                        "name": " Зіньків ",
                        "areas": []
                    }, {"id": " 3223 ", "parent_id": " 2193 ", "name": " Карлівка ", "areas": []}, {
                        "id": " 3224 ",
                        "parent_id": " 2193 ",
                        "name": " Кобеляки ",
                        "areas": []
                    }, {"id": " 3225 ", "parent_id": "2193 ", "name": " Козельщина ", "areas": []}, {
                        "id": " 2194 ",
                        "parent_id": " 2193 ",
                        "name": " Горішні Плавні (Комсомольськ) ",
                        "areas": []
                    }, {"id": " 3226 ", "parent_id": " 2193 ", "name": " Котельва ", "areas": []}, {
                        "id": " 2107 ",
                        "parent_id": " 2193 ",
                        "name": " Кременчук ",
                        "areas": []
                    }, {"id": " 3227 ", "parent_id": " 2193 ", "name": " Лохвиця ", "areas": []}, {
                        "id": "2196",
                        "parent_id": "2193",
                        "name": "Лубни",
                        "areas": []
                    }, {"id": "3228", "parent_id": "2193", "name": "Машівка", "areas": []}, {
                        "id": "2485",
                        "parent_id": "2193",
                        "name": "Миргород",
                        "areas": []
                    }, {"id": "3229", "parent_id": "2193", "name": "Нові Санжари", "areas": []}, {
                        "id": "3230",
                        "parent_id": "2193",
                        "name": "Оржиця",
                        "areas": []
                    }, {"id": "3231", "parent_id": "2193", "name": "Пирятин", "areas": []}, {
                        "id": "128",
                        "parent_id": "2193",
                        "name": "Полтава",
                        "areas": []
                    }, {"id": "3232", "parent_id": "2193", "name": " Решетилівка ", "areas": []}, {
                        "id": " 3233 ",
                        "parent_id": " 2193 ",
                        "name": " Семенівка (Полтавська область) ",
                        "areas": []
                    }, {"id": " 3234 ", "name": " 2193 ", "name": " Хорол ", "areas": []}, {
                        "id": " 3654 ",
                        "parent_id": " 2193 ",
                        "name": " Червонозаводське ",
                        "areas": []
                    }, {"id": " 3235 ", "parent_id": " 2193 ", "name": " Чорнухи ", "areas": []}, {
                        "id": " 3236 ",
                        "parent_id": " 2193 ",
                        "name": " Чутове ",
                        "areas": []
                    }, {"id": " 3237 ", "parent_id": " 2193 ", "name": " Шишаки ", "areas": []}]
                }, {
                    "id": "2198",
                    "parent_id": "5",
                    "name": "Рівненська область",
                    "areas": [{"id": "3492", "parent_id": "2198", "name": "Березне", "areas": []}, {
                        "id": "3493",
                        "parent_id": "2198",
                        "name": "Володимирець",
                        "areas": []
                    }, {"id": "3494", "parent_id": "2198", "name": "Гоща", "areas": []}, {
                        "id": "3495",
                        "parent_id": "2198",
                        "name": "Демидівка",
                        "areas": []
                    }, {"id": "3496", "parent_id": "2198", "name": "Дубно", "areas": []}, {
                        "id": "3497",
                        "parent_id": "2198",
                        "name": "Дубровиця",
                        "areas": []
                    }, {"id": "3498", "parent_id": "2198", "name": "Зарічне", "areas": []}, {
                        "id": "3499",
                        "parent_id": "2198",
                        "name": "Здолбунів",
                        "areas": []
                    }, {"id": "3500", "parent_id": " 2198 ", "name": " Корець ", "areas ": []}, {
                        "id": " 3501 ",
                        "parent_id": " 2198 ",
                        "name": " Костопіль ",
                        "areas": []
                    }, {"id": " 2944 ", "parent_id": " 2198 ", "name": " Кузнецовськ ", "areas": []}, {
                        "id": " 3502 ",
                        "parent_id": " 2198 ",
                        "name": " Млинів ",
                        "areas": []
                    }, {"id": " 3503 ", "parent_id": " 2198 ", "name": " Острог ", "areas": []}, {
                        "id": " 3504 ",
                        "parent_id": " 2198 ",
                        "name": "Радивилів",
                        "areas": []
                    }, {"id": "129", "parent_id": "2198", "name": "Рівне", "areas": []}, {
                        "id": "3505",
                        "parent_id": "2198",
                        "name": "Рокитне",
                        "areas": []
                    }, {"id": "3069", "parent_id": "2198", "name": " Сарни ", "areas": []}]
                }, {
                    "id": " 2200 ",
                    "parent_id": " 5 ",
                    "name": " Сумська область ",
                    "areas": [{"id": " 2443 ", "parent_id": "2200", "name": "Охтирка", "areas": []}, {
                        "id": "3464",
                        "parent_id": "2200",
                        "name": "Білопілля",
                        "areas": []
                    }, {"id": "3465", "parent_id": "2200", "name": "Буринь", "areas": []}, {
                        "id": "3466",
                        "parent_id": " 2200 ",
                        "name": " Велика Писарівка ",
                        "areas": []
                    }, {"id": " 3639 ", "parent_id": " 2200 ", "name": " Ворожба ", "areas": []}, {
                        "id": "3467",
                        "parent_id": "2200",
                        "name": "Глухів",
                        "areas": []
                    }, {"id": "3642", "parent_id": "2200", "name": "Дружба", "areas": []}, {
                        "id": " 2201 ",
                        "parent_id": " 2200 ",
                        "name": " Конотоп ",
                        "areas": []
                    }, {
                        "id": " 3468 ",
                        "parent_id": " 2200 ",
                        "name": " Краснопілля (Сумська область) ",
                        "areas": []
                    }, {"id": " 3469 ", "parent_id": " 2200 ", "name": "Кролевець ", "areas": []}, {
                        "id": " 3470 ",
                        "parent_id": " 2200 ",
                        "name": " Лебедин ",
                        "areas": []
                    }, {"id": " 3471 ", "parent_id": " 2200 ", "name": " Долина ", "areas": []}, {
                        "id": " 3472 ",
                        "parent_id": " 2200 ",
                        "name": " Недригайлів ",
                        "areas": []
                    }, {"id": " 3473 ", "parent_id": " 2200 ", "name": " Путивль ", "areas": []}, {
                        "id": " 2994 ",
                        "parent_id": "2200 ",
                        "name": " Ромни ",
                        "areas": []
                    }, {"id": " 3474 ", "parent_id": " 2200 ", "name": " Середина-Буда ", "areas": []}, {
                        "id": "132",
                        "parent_id": "2200",
                        "name": "Суми",
                        "areas": []
                    }, {"id": "3475", "parent_id": "2200", "name": "Тростянець (Сумська область)", "areas": []}, {
                        "id": "2203",
                        "parent_id": "2200",
                        "name": "Шостка",
                        "areas": []
                    }, {"id": "3476", "parent_id": "2200", "name": "Ямпіль (Сумська область)", "areas": []}]
                }, {
                    "id": "2204",
                    "name": " 5 ",
                    "name": " Тернопільська область ",
                    "areas": [{"id": " 2722 ", "parent_id": " 2204 ", "name": " Бережани ", "areas": []}, {
                        "id": "2723",
                        "parent_id": "2204",
                        "name": "Борщів",
                        "areas": []
                    }, {"id": "3477", "parent_id": "2204", "name": "Бучач", "areas": []}, {
                        "id": "3478",
                        "parent_id": "2204",
                        "name": "Гусятин",
                        "areas": []
                    }, {"id": "3479", "parent_id": "2204", "name": "Заліщики", "areas": []}, {
                        "id": "3480",
                        "parent_id": " 2204 ",
                        "name": " Збараж ",
                        "areas": []
                    }, {"id": " 3481 ", "parent_id": " 2204 ", "name": " Зборів ", "areas": []}, {
                        "id": "3482",
                        "parent_id": "2204",
                        "name": "Козова",
                        "areas": []
                    }, {"id": "3625", "parent_id": "2204", "name": "Копичинці", "areas": []}, {
                        "id": " 3483 ",
                        "parent_id": " 2204 ",
                        "name": " Кременець ",
                        "areas": []
                    }, {"id": " 3484 ", "parent_id": " 2204 ", "name": " Ланівці ", "areas": []}, {
                        "id": " 3485 ",
                        "parent_id": " 2204 ",
                        "name": " Монастириська ",
                        "areas ": []
                    }, {"id": " 3486 ", "parent_id": " 2204 ", "name": " Підволочиськ ", "areas": []}, {
                        "id": " 3487 ",
                        "parent_id": " 2204 ",
                        "name": " Підгайці ",
                        "areas": []
                    }, {"id": " 3488 ", "parent_id": " 2204 ", "name": " Почаїв ", "areas": []}, {
                        "id": " 3648 ",
                        "parent_id": " 2204 ",
                        "name": " Скалат ",
                        "areas": []
                    }, {"id": " 3489 ", "parent_id": " 2204 ", "name": "Теребовля ", "areas": []}, {
                        "id": " 133 ",
                        "parent_id": " 2204 ",
                        "name": " Тернопіль ",
                        "areas": []
                    }, {"id": " 3490 ", "parent_id": " 2204 ", "name": " Чортків ", "areas": []}, {
                        "id": " 3491 ",
                        "parent_id": " 2204 ",
                        "name": " Шумськ ",
                        "areas": []
                    }]
                }, {
                    "id": " 2206 ",
                    "parent_id": " 5 ",
                    "name": " Харківська область ",
                    "areas": [{"id": " 3108 ", "name": " 2206 ", "name": " Балаклея ", "areas": []}, {
                        "id": " 3620 ",
                        "parent_id": " 2206 ",
                        "name": " Барвінкове ",
                        "areas": []
                    }, {"id": " 3109 ", "parent_id": " 2206 ", "name": " Близнюки ", "areas": []}, {
                        "id": " 3110 ",
                        "parent_id": " 2206 ",
                        "name": " Богодухів ",
                        "areas": []
                    }, {"id": " 3624 ", "parent_id": " 2206 ", "name": " Валки ", "areas": []}, {
                        "id": "3111 ",
                        "parent_id": " 2206 ",
                        "name": " Великий Бурлук ",
                        "areas": []
                    }, {
                        "id": " 3112 ",
                        "parent_id": " 2206 ",
                        "name": " Вовчанськ (Харківська область) ",
                        "areas": []
                    }, {"id": " 3113 ", "parent_id": " 2206 ", "name": " Дворічна ", "areas": []}, {
                        "id": " 3114 ",
                        "parent_id": " 2206 ",
                        "name": " Дергачі ",
                        "areas": []
                    }, {"id": " 3115 ", "parent_id": " 2206 ", "name": "Зачепилівка", "areas": []}, {
                        "id": "3116",
                        "parent_id": "2206",
                        "name": "Зміїв",
                        "areas": []
                    }, {"id": "3117", "parent_id": "2206", "name": "Золочів (Харківська область)", "areas": []}, {
                        "id": "2207",
                        "parent_id": " 2206 ",
                        "name": " Ізюм ",
                        "areas": []
                    }, {"id": " 3118 ", "parent_id": " 2206 ", "name": " Кегичівка ", "areas": []}, {
                        "id": "3119",
                        "parent_id": "2206",
                        "name": "Коломак",
                        "areas": []
                    }, {"id": "3120", "parent_id": "2206", "name": "Комсомольське", "areas": []}, {
                        "id": "3140",
                        "parent_id": "2206",
                        "name": "Красноград",
                        "areas": []
                    }, {"id": "3121", "parent_id": "2206", "name": "Краснокутська", "areas": []}, {
                        "id": "3122",
                        "parent_id": " 2206 ",
                        "name": " Куп'янськ ",
                        "areas": []
                    }, {"id": "3123", "parent_id": "2206", "name": "Лозова", "areas": []}, {
                        "id": "3623",
                        "parent_id": "2206",
                        "name": "Люботин",
                        "areas": []
                    }, {"id": "3124", "parent_id": "2206", "name": "Мала Данилівка", "areas": []}, {
                        "id": "3125",
                        "parent_id": "2206",
                        "name": "Мерефа",
                        "areas": []
                    }, {"id": "3126", "parent_id": "2206", "name": "Нова Водолага", "areas": []}, {
                        "id": "3127",
                        "parent_id": "2206",
                        "name": "Первомайський (Харківська область)",
                        "areas": []
                    }, {"id": "3128", "parent_id": "2206", "name": "Печеніги", "areas": []}, {
                        "id": "3129",
                        "parent_id": "2206",
                        "name": "Сахновщина",
                        "areas": []
                    }, {"id": "135", "parent_id": "2206", "name": "Харків", "areas": []}, {
                        "id": "3130",
                        "parent_id": "2206",
                        "name": "Чугуїв",
                        "areas": []
                    }, {"id": "3131", "parent_id": "2206", "name": "Шевченкове", "areas": []}]
                }, {
                    "id": "2209",
                    "parent_id": "5",
                    "name": "Херсонська область",
                    "areas": [{"id": "3506", "parent_id": "2209", "name": "Білозерка", "areas": []}, {
                        "id": "3507",
                        "parent_id": "2209",
                        "name": "Берислав ",
                        "areas": []
                    }, {"id": " 3508 ", "parent_id": " 2209 ", "name": " Велика Олександрівка ", "areas": []}, {
                        "id": "3509",
                        "parent_id": "2209",
                        "name": "Велика Лепетиха",
                        "areas": []
                    }, {"id": "3510", "parent_id": "2209", "name": "Великі Копані", "areas": []}, {
                        "id": "3511",
                        "parent_id": "2209",
                        "name": "Верхній Рогачик",
                        "areas": []
                    }, {"id": " 3512 ", "name": " 2209 ", "name": " Високопілля ", "areas": []}, {
                        "id": " 3513 ",
                        "parent_id": " 2209 ",
                        "name": " Генічеськ ",
                        "areas": []
                    }, {"id": " 3514 ", "parent_id": " 2209 ", "name": " Гола Пристань ", "areas": []}, {
                        "id": " 3515 ",
                        "parent_id": " 2209 ",
                        "name": " Горностаївка ",
                        "areas": []
                    }, {
                        "id": " 3516 ",
                        "parent_id": " 2209 ",
                        "name": "Іванівка (Херсонська область) ",
                        "areas": []
                    }, {"id": " 3517 ", "parent_id": " 2209 ", "name": " Каланчак ", "areas": []}, {
                        "id": " 3518 ",
                        "parent_id": " 2209 ",
                        "name": " Каховка ",
                        "areas": []
                    }, {"id": " 3519 ", "parent_id": " 2209 ", "name": " Нижні Сірогози ", "areas": []}, {
                        "id": " 2210 ",
                        "parent_id": " 2209 ",
                        "name": " Нова Каховка ",
                        "areas": []
                    }, {"id": "3520", "name": " 2209 ", "name": " Нововоронцовка ", "areas": []}, {
                        "id": " 3521 ",
                        "parent_id": " 2209 ",
                        "name": " Новотроїцьке ",
                        "areas": []
                    }, {"id": " 3522 ", "parent_id": " 2209 ", "name": " Скадовськ ", "areas": []}, {
                        "id": " 3649 ",
                        "parent_id": " 2209 ",
                        "name": " Таврійськ ",
                        "areas": []
                    }, {"id": " 136 ", "parent_id": " 2209 ", "name": " Херсон ", "areas": []}, {
                        "id": "3523",
                        "parent_id": "2209",
                        "name": "Цюрупинськ",
                        "areas": []
                    }, {"id": "3524", "parent_id": "2209", "name": " Чаплинка ", "areas": []}]
                }, {
                    "id": " 2212 ",
                    "parent_id": " 5 ",
                    "name": " Хмельницька область ",
                    "areas": [{"id": " 3409 ", "parent_id": " 2212 ", "name": " Білогір'я ", "areas": []}, {
                        "id": " 3410 ",
                        "parent_id": " 2212 ",
                        "name": " Віньківці ",
                        "areas ": []
                    }, {"id": " 3411 ", "parent_id": " 2212 ", "name": " Волочиськ ", "areas": []}, {
                        "id": " 3412 ",
                        "parent_id": " 2212 ",
                        "name": " Городок (Хмельницька область) ",
                        "areas": []
                    }, {"id": " 3413 ", "parent_id": " 2212 ", "name": " Деражня ", "areas": []}, {
                        "id": " 3414 ",
                        "parent_id": " 2212 ",
                        "name": " Дунаївці ",
                        "areas": []
                    }, {"id": " 3415 ", "parent_id": " 2212 ", "name": "Ізяслав", "areas": []}, {
                        "id": "2213",
                        "parent_id": "2212",
                        "name": "Кам'янець-Подільський",
                        "areas": []
                    }, {"id": " 3416 ", "parent_id": " 2212 ", "name": " Красилів ", "areas": []}, {
                        "id": " 3417 ",
                        "parent_id": " 2212 ",
                        "name": "Летичів",
                        "areas": []
                    }, {"id": "3418", "parent_id": "2212", "name": "Нетішин", "areas": []}, {
                        "id": "3419",
                        "parent_id": "2212",
                        "name": "Нова Ушиця",
                        "areas": []
                    }, {"id": "3420", "parent_id": "2212", "name": "Полонне", "areas": []}, {
                        "id": "2712",
                        "parent_id": "2212",
                        "name": "Славута",
                        "areas": []
                    }, {"id": "3421", "parent_id": "2212", "name": "Стара Синява", "areas": []}, {
                        "id": "3422",
                        "parent_id": "2212",
                        "name": "Старокостянтинів",
                        "areas": []
                    }, {"id": "3423", "parent_id": "2212", "name": "Теофіполь", "areas": []}, {
                        "id": "137",
                        "parent_id": "2212",
                        "name": "Хмельницький",
                        "areas": []
                    }, {"id": "3424", "parent_id": "2212", "name": "Чемерівці", "areas": []}, {
                        "id": "2215",
                        "parent_id": "2212",
                        "name": "Шепетівка",
                        "areas": []
                    }, {"id": "3425", "parent_id": "2212", "name": " Ярмолинці ", "areas": []}]
                }, {
                    "id": "2216",
                    "parent_id": "5",
                    "name": "Черкаська область",
                    "areas": [{"id": "3357", "parent_id": "2216", "name": "Ватутіне", "areas": []}, {
                        "id": "3358",
                        "parent_id": "2216",
                        "name": "Городище (Черкаська область)",
                        "areas": []
                    }, {"id": " 3359 ", "parent_id": " 2216 ", "name": " Драбів ", "areas": []}, {
                        "id": " 2711 ",
                        "parent_id": " 2216 ",
                        "name": " Жашків ",
                        "areas": []
                    }, {"id": " 3360 ", "parent_id": " 2216 ", "name": " Звенигородка ", "areas": []}, {
                        "id": " 3361 ",
                        "parent_id": " 2216 ",
                        "name": " Золотоноша ",
                        "areas": []
                    }, {
                        "id": " 3362 ",
                        "parent_id": " 2216 ",
                        "name": " Кам'янка (Черкаська область) ",
                        "areas": []
                    }, {"id": " 3363 ", "parent_id": " 2216 ", "name": " Канів ", "areas": []}, {
                        "id": "3364",
                        "parent_id": "2216",
                        "name": "Катеринопіль",
                        "areas": []
                    }, {"id": "3365", "parent_id": "2216", "name": " Корсунь-Шевченківський ", "areas": []}, {
                        "id": " 3366 ",
                        "parent_id": " 2216 ",
                        "name": " Лисянка ",
                        "areas": []
                    }, {"id": "3367", "parent_id": "2216", "name": "Маньківка", "areas": []}, {
                        "id": "3368",
                        "parent_id": "2216",
                        "name": "Монастирище ",
                        "areas": []
                    }, {"id": " 2217 ", "parent_id": " 2216 ", "name": " Сміла ", "areas": []}, {
                        "id": " 3369 ",
                        "parent_id": " 2216 ",
                        "name": " Тальне ",
                        "areas": []
                    }, {"id": " 2218 ", "parent_id": " 2216 ", "name": " Умань ", "areas": []}, {
                        "id": " 3370 ",
                        "parent_id": " 2216 ",
                        "name": " Христинівка ",
                        "areas": []
                    }, {"id": " 138 ", "parent_id": " 2216 ", "name": "Черкаси", "areas": []}, {
                        "id": "3371",
                        "parent_id": "2216",
                        "name": "Чернобай",
                        "areas": []
                    }, {"id": "3372", "parent_id": "2216", "name": "Чигирин", "areas": []}, {
                        "id": "3373",
                        "parent_id": "2216",
                        "name": " Шпола ",
                        "areas": []
                    }]
                }, {
                    "id": " 2220 ",
                    "parent_id": " 5 ",
                    "name": " Чернігівська область ",
                    "areas": [{"id": "3573", "parent_id": "2220", "name": "Бахмач", "areas": []}, {
                        "id": "3574",
                        "parent_id": "2220",
                        "name": " Бобровиця ",
                        "areas": []
                    }, {"id": " 3575 ", "parent_id": " 2220 ", "name": " Борзна ", "areas": []}, {
                        "id": " 3576 ",
                        "parent_id": " 2220 ",
                        "name": " Варва ",
                        "areas": []
                    }, {"id": " 3577 ", "parent_id": " 2220 ", "name": " Городня ", "areas": []}, {
                        "id": " 3578 ",
                        "parent_id": " 2220 ",
                        "name": " Ічня ",
                        "areas": []
                    }, {"id": " 3579 ", "parent_id": " 2220 ", "name": " Козелець ", "areas": []}, {
                        "id": " 3580 ",
                        "parent_id": " 2220 ",
                        "name": " Короп ",
                        "areas": []
                    }, {"id": " 3581 ", "parent_id": " 2220 ", "name": " Корюківка ", "areas": []}, {
                        "id": " 3582 ",
                        "parent_id": " 2220 ",
                        "name": "Куликівка",
                        "areas": []
                    }, {"id": "3583", "parent_id": "2220", "name": "Мена", "areas": []}, {
                        "id": "2221",
                        "parent_id": "2220",
                        "name": "Ніжин",
                        "areas": []
                    }, {"id": "3584", "parent_id": "2220", "name": "Новгород-Сіверський", "areas": []}, {
                        "id": "3585",
                        "parent_id": "2220",
                        "name": "Носівка",
                        "areas": []
                    }, {"id": "2222", "parent_id": "2220", "name": " Прилуки ", "areas": []}, {
                        "id": " 3586 ",
                        "parent_id": " 2220 ",
                        "name": " Ріпки ",
                        "areas": []
                    }, {"id": " 3647 ", "parent_id": " 2220 ", "name": " Седнів ", "areas": []}, {
                        "id": " 3587 ",
                        "parent_id": " 2220 ",
                        "name": " Семенівка (Чернігівська область) ",
                        "areas": []
                    }, {"id": " 3588 ", "parent_id": " 2220 ", "name": " Сосниця ", "areas": []}, {
                        "id": "3589",
                        "parent_id": "2220",
                        "name": "Срібне",
                        "areas": []
                    }, {"id": "3590", "parent_id": "2220", "name": "Талалаївка", "areas": []}, {
                        "id": " 140 ",
                        "parent_id": " 2220 ",
                        "name": " Чернігів ",
                        "areas": []
                    }, {"id": " 3591 ", "parent_id": " 2220 ", "name": " Щорс ", "areas": []}]
                }, {
                    "id": " 2224 ",
                    "parent_id": " 5 ",
                    "name": " Чернівецька область ",
                    "areas ": [{"id": " 3631 ", "parent_id": " 2224 ", "name": " Батурин ", "areas": []}, {
                        "id": " 3636 ",
                        "parent_id": "2224",
                        "name": "Вашківці",
                        "areas": []
                    }, {"id": "3542", "parent_id": "2224", "name": "Вижниця", "areas": []}, {
                        "id": "3543",
                        "parent_id": "2224",
                        "name": "Герца",
                        "areas": []
                    }, {"id": "3544", "parent_id": " 2224 ", "name": " Глибока ", "areas": []}, {
                        "id": "3545",
                        "parent_id": "2224",
                        "name": "Заставна",
                        "areas": []
                    }, {"id": "3546", "parent_id": "2224", "name": "Кельменці", "areas": []}, {
                        "id": "3547",
                        "parent_id": "2224",
                        "name": "Кіцмань",
                        "areas": []
                    }, {"id": "3548", "parent_id": "2224", "name": "Новодністровськ", "areas": []}, {
                        "id": "3549",
                        "parent_id": " 2224 ",
                        "name": " Новоселиця ",
                        "areas": []
                    }, {"id": " 3550 ", "parent_id": " 2224 ", "name": " Путила ", "areas": []}, {
                        "id": " №3551 ",
                        "parent_id": " 2224 ",
                        "name": " Сокиряни ",
                        "areas": []
                    }, {"id": " 3552 ", "parent_id": " 2224 ", "name": " Сторожинець ", "areas": []}, {
                        "id": " 3553 ",
                        "parent_id": " 2224 ",
                        "name": " Хотин ",
                        "areas": []
                    }, {"id": " 139 ", "parent_id": "2224", "name": "Чернівці", "areas": []}]
                }]
            }
        ;

        let gender = getRandomArbitrary(0, 1);
        let name = getRandomArbitrary(0, users.length - 1);
        let action = getRandomArbitrary(0, actions.length - 1);
        let region = getRandomArbitrary(0, cities.areas.length - 1);
        let city = getRandomArbitrary(0, cities.areas[region].areas.length - 1);

        $dataNMessage.html(
            `<strong>${users[gender][name]}</strong> з ${cities.areas[region].areas.length === 0 ? `${lvovich.cityFrom(cities.areas[region].name)}` : `${lvovich.cityFrom(cities.areas[region].areas[city].name)}`} ${actions[gender][action]} на <strong>${getRandomArbitrary(1, 9) * 1250} грн.</strong>`
        );

        $widgetPreview.addClass("active");

        setTimeout(function () {

            $widgetPreview.removeClass("active");

            setTimeout(function () {
                generateNotice()
            }, getRandomArbitrary(1, 9) * 1250);

        }, 3000);

    }

    function getRandomArbitrary(min, max) {
        min = Math.ceil(min);
        max = Math.floor(max);
        return Math.floor(Math.random() * (max - min + 1)) + min;
    }     


});